---
kind: type
id: T:Autodesk.Revit.DB.ThermalAsset
source: html/c4dac7e3-96e2-bc6c-1299-f696a253e879.htm
---
# Autodesk.Revit.DB.ThermalAsset

Represents the properties of a material pertinent to energy analysis.

## Syntax (C#)
```csharp
public class ThermalAsset : IDisposable
```